let fs = require('fs');

var obj = {
  "易方达港股通红利混合": [
    "005583"
  ],
  "嘉实港股通新经济指数": [
    "501311",
    "006614"
  ],
  "广发港股通成长精选股票": [
    "009896"
  ],
  "摩根标普港股通低波红利指数": [
    "005051"
  ],
  "华安香港精选股票(QDII)": [
    "040018"
  ],
  "嘉实港股优势混合": [
    "010041",
    "010042"
  ],
  "华夏港股通精选股票发起式(LOF)": [
    "160322",
    "012884"
  ],
  "易方达恒生科技(QDII-ETF)": [
    "513010"
  ],
  "华宝香港大盘": [
    "501301",
    "006355"
  ],
  "易方达香港小型股指数": [
    "161124"
  ],
  "鹏华香港银行指数(LOF)": [
    "501025"
  ],
  "汇添富港股通专注成长": [
    "005228"
  ],
  "华泰柏瑞中证港股通50ETF": [
    "513550"
  ],
  "富国中证港股通互联网ETF发起式联接": [
    "014673",
    "014674"
  ],
  "博时港股通领先趋势混合": [
    "011162",
    "011163"
  ],
  "国投瑞银港股通混合": [
    "007110",
    "011081"
  ],
  "易方达港股通成长混合": [
    "012346",
    "012347"
  ],
  "嘉实恒生科技ETF(QDII)": [
    "159741"
  ],
  "广发港股通优质增长混合": [
    "006595",
    "013392"
  ],
  "汇添富港股红利ETF联接": [
    "501305",
    "501306"
  ],
  "国富港股通远见价值混合": [
    "009846",
    "017947"
  ],
  "天弘港股通精选": [
    "006752",
    "006753"
  ],
  "富国中证港股通互联网ETF": [
    "159792"
  ],
  "广发中证香港创新药ETF(QDII)": [
    "513120"
  ],
  "南方港股通优势企业混合": [
    "012588",
    "012589"
  ],
  "前海开源港股通股息率50强": [
    "004098"
  ],
  "华安CES港股通ETF": [
    "513900"
  ],
  "汇丰晋信港股通双核策略混合": [
    "007291"
  ],
  "景顺长城中证港股通科技ETF": [
    "513980"
  ],
  "嘉实港股互联网产业核心资产": [
    "011924",
    "011925"
  ],
  "永赢港股通品质生活慧选混合": [
    "009983",
    "021918"
  ],
  "华泰柏瑞中证港股通高股息投资ETF(QDII)": [
    "513530"
  ],
  "浙商中华预期高股息": [
    "007178",
    "007216"
  ],
  "摩根标普港股通低波红利ETF": [
    "513630"
  ],
  "广发恒生中型股指数(LOF)": [
    "501303"
  ],
  "工银瑞信中证港股通高股息精选ETF": [
    "159691"
  ],
  "鹏华中证港股通医药卫生综合交易ETF": [
    "513700"
  ],
  "汇添富国证港股通创新药ETF发起式联接": [
    "021030",
    "021031"
  ],
  "富国港股通策略精选混合": [
    "011635",
    "011636"
  ],
  "汇添富中证港股通高股息投资ETF": [
    "513820"
  ],
  "易方达恒生港股通高股息低波动ETF": [
    "159545"
  ],
  "富国恒生港股通高股息低波动ETF(QDII)": [
    "513950"
  ],
  "华夏中证港股通央企红利ETF": [
    "513910"
  ],
  "中庚港股通价值股票": [
    "017650"
  ],
  "华泰柏瑞港股通时代机遇混合": [
    "011355",
    "011356"
  ],
  "华宝中证港股通互联网ETF": [
    "513770"
  ],
  "银华港股通精选股票发起式": [
    "009017",
    "014052"
  ],
  "泰康港股通大消费指数": [
    "006786",
    "006787"
  ],
  "平安港股通恒生中国企业ETF": [
    "159960"
  ],
  "海富通中证港股通科技ETF": [
    "513860"
  ],
  "招商上证港股通ETF": [
    "513990"
  ],
  "创金合信港股通量化股票": [
    "007354",
    "007357"
  ],
  "易方达中证港股通医药卫生综合ETF": [
    "513200"
  ],
  "华宝中证港股通互联网ETF发起联接": [
    "017125",
    "017126"
  ],
  "富国港股通量化精选股票": [
    "005707",
    "014163"
  ],
  "华泰柏瑞港股通量化混合": [
    "005269",
    "021710"
  ],
  "创金合信港股互联网3个月持有期混合(QDII)": [
    "012379",
    "012380"
  ],
  "国泰中证港股通科技ETF": [
    "513020"
  ],
  "华安恒生港股通中国央企红利ETF": [
    "513920"
  ],
  "民生加银港股通高股息": [
    "004532",
    "004533"
  ],
  "汇添富国证港股通创新药ETF": [
    "159570"
  ],
  "摩根香港精选港股通混合": [
    "005701",
    "016921"
  ],
  "银华中证港股通消费主题ETF": [
    "159735"
  ],
  "工银瑞信国证港股通科技30ETF": [
    "159636"
  ],
  "中银港股通医药混合发起": [
    "020397",
    "020398"
  ],
  "南方恒生生物科技ETF(QDII)": [
    "159615"
  ],
  "恒生前海港股通精选混合": [
    "006537"
  ],
  "华夏港股前沿经济混合(QDII)": [
    "012208",
    "012209"
  ],
  "汇丰晋信港股通精选股票": [
    "006781"
  ],
  "景顺长城港股通全球竞争力": [
    "012227",
    "012228"
  ],
  "长城港股通价值精选混合": [
    "007132",
    "017627"
  ],
  "银华恒生港股通中国科技ETF": [
    "513160"
  ],
  "浦银安盛港股通量化混合": [
    "005255",
    "013224"
  ],
  "银华国证港股通创新药ETF": [
    "159567"
  ],
  "华泰柏瑞港股通红利ETF联接基金": [
    "018387",
    "018388"
  ],
  "景顺长城中证港股通科技ETF发起联接": [
    "016495",
    "016496"
  ],
  "东财中证沪港深互联网ETF发起式联接": [
    "012372"
  ],
  "景顺长城中证国新港股通央企红利ETF": [
    "520990"
  ],
  "中银港股通优势成长股票": [
    "010204"
  ],
  "易方达中证港股通消费主题ETF": [
    "513070"
  ],
  "招商恒生港股通高股息低波动ETF": [
    "520550"
  ],
  "鹏华中证港股通消费主题ETF": [
    "513590"
  ],
  "平安中证港股通医药卫生综合ETF": [
    "159718"
  ],
  "汇添富恒生生物科技ETF(QDII)": [
    "513280"
  ],
  "广发中证国新港股通央企红利ETF": [
    "520900"
  ],
  "易方达港股通医药ETF联接": [
    "018557",
    "018558"
  ],
  "富国恒生红利ETF联接": [
    "019260"
  ],
  "广发中证港股通非银ETF": [
    "513750"
  ],
  "鹏华中证港股通科技ETF": [
    "159751"
  ],
  "富国恒生港股通医疗保健ETF发起式联接": [
    "020110",
    "020111"
  ],
  "中欧中证港股通创新药指数发起": [
    "021759",
    "021760"
  ],
  "中欧港股通精选一年持有混合": [
    "013991",
    "013992"
  ],
  "景顺长城量化港股通股票": [
    "006106",
    "018861"
  ],
  "富国恒生港股通医疗保健ETF": [
    "159506"
  ],
  "银华中证港股通医药卫生综合ETF": [
    "159776"
  ],
  "华夏中证港股通消费主题ETF": [
    "513230"
  ],
  "国泰中证港股通科技ETF发起联接": [
    "015739",
    "015740"
  ],
  "贝莱德港股通远景视野混合": [
    "014746",
    "014747"
  ],
  "南方中证国新港股通央企红利ETF": [
    "520660"
  ],
  "易方达港股通优质增长混合": [
    "017973",
    "017974"
  ],
  "万家中证港股通央企红利ETF": [
    "159333"
  ],
  "中欧丰泰港股通混合": [
    "016297",
    "016298"
  ],
  "易方达恒生红利低波ETF联接": [
    "021457"
  ],
  "易方达中证港股通互联网ETF": [
    "513040"
  ],
  "博时恒生高股息率ETF发起式联接": [
    "014519",
    "014520"
  ],
  "中欧港股数字经济混合发起(QDII)": [
    "015884",
    "015885"
  ],
  "华夏中证港股通内地金融ETF": [
    "513190"
  ],
  "华夏港股通央企红利ETF联接": [
    "021142",
    "021143"
  ],
  "华安CES港股通ETF联接": [
    "005813",
    "005814"
  ],
  "兴银中证港股通科技ETF": [
    "513560"
  ],
  "易方达中证港股通互联网ETF发起式联接": [
    "019313",
    "019314"
  ],
  "易方达恒生港股通新经济ETF": [
    "513320"
  ],
  "华泰柏瑞港股通科技ETF": [
    "513150"
  ],
  "华夏中证港股通50ETF": [
    "159711"
  ],
  "景顺长城国证港股通红利低波动率ETF": [
    "159569"
  ],
  "大成港股精选混合(QDII)": [
    "011583",
    "011584"
  ],
  "国泰中证港股通50ETF": [
    "159712"
  ],
  "国泰中证港股通高股息投资ETF": [
    "159331"
  ],
  "易方达中证港股通消费主题ETF发起式联接": [
    "018103",
    "018104"
  ],
  "华泰柏瑞恒生港股通高股息低波动ETF": [
    "520890"
  ],
  "易方达中证港股通中国100ETF": [
    "159788"
  ],
  "南方港股创新视野一年持有混合": [
    "012586",
    "012587"
  ],
  "西部利得港股通新机遇混合": [
    "008861",
    "010093"
  ],
  "景顺长城中证港股通创新药ETF": [
    "513780"
  ],
  "银华中证港股高股息ETF": [
    "159302"
  ],
  "博时港股通互联网ETF": [
    "159568"
  ],
  "万家港股通精选混合": [
    "013009",
    "013010"
  ],
  "易方达恒生港股通创新药ETF": [
    "159316"
  ],
  "睿远港股通核心价值混合": [
    "022700",
    "022701"
  ],
  "平安港股通红利精选混合发起式": [
    "021046",
    "021047"
  ],
  "广发中证港股通非银ETF发起式联接": [
    "020500",
    "020501"
  ],
  "景顺长城中证港股通创新药ETF联接": [
    "023597",
    "023598"
  ],
  "招商港股通核心精选股票": [
    "011651",
    "011652"
  ],
  "万家中证港股通创新药ETF": [
    "520700"
  ],
  "华夏中证港股通消费主题ETF发起式联接": [
    "017832",
    "017833"
  ],
  "工银国证港股通科技ETF发起式联接": [
    "019933",
    "019934"
  ],
  "兴业中证港股通互联网指数发起式": [
    "021377",
    "021378"
  ],
  "广发恒生中型股指数": [
    "004996"
  ],
  "海富通中证港股通科技ETF发起联接": [
    "021464",
    "021465"
  ],
  "广发中证港股通汽车ETF": [
    "520600"
  ],
  "工银国证港股通创新药ETF": [
    "159217"
  ],
  "建信港股通精选混合": [
    "011969",
    "011970"
  ],
  "南方港股数字经济混合发起(QDII)": [
    "019265",
    "019266"
  ],
  "景顺长城中证国新港股通央企红利ETF联接": [
    "021961",
    "021962"
  ],
  "鹏华中证港股通消费ETF联接": [
    "016952",
    "016953"
  ],
  "华安恒生港股通中国央企红利ETF发起式联接": [
    "020866",
    "020867"
  ],
  "永赢港股通优质成长一年混合": [
    "011315"
  ],
  "国投瑞银港股通6个月定开股票": [
    "010010"
  ],
  "华夏中证港股通汽车产业主题ETF": [
    "159323"
  ],
  "广发中证港股通互联网指数发起式": [
    "021092",
    "021093"
  ],
  "广发恒生港股通科技主题ETF": [
    "159262"
  ],
  "中欧中证港股通央企红利指数发起(QDII)": [
    "021583",
    "021584"
  ],
  "南方中证港股通汽车产业主题指数发起": [
    "022750",
    "022751"
  ],
  "嘉实中证港股通高股息投资ETF": [
    "513830"
  ],
  "华夏中证港股通内地金融ETF发起式联接": [
    "020422",
    "020423"
  ],
  "鹏华中证港股通科技ETF发起式联接": [
    "021294",
    "021295"
  ],
  "银华恒指港股通ETF": [
    "159318"
  ],
  "富国港股通红利精选混合": [
    "021513",
    "021514"
  ],
  "广发恒指港股通ETF": [
    "159312"
  ],
  "平安中证港股医药ETF联接": [
    "019598",
    "019599"
  ],
  "融通中证港股通科技指数": [
    "021891",
    "021892"
  ],
  "万家中证港股通创新药ETF发起式联接": [
    "023481",
    "023482"
  ],
  "天弘恒生港股通高股息低波动指数": [
    "023410",
    "023411"
  ],
  "银华国证港股通创新药ETF发起式联接": [
    "023929",
    "023930"
  ],
  "富国国证港股通消费主题ETF": [
    "159245"
  ],
  "天弘中证港股通高股息投资指数发起": [
    "022072",
    "022073"
  ],
  "易方达中证港股通高股息投资指数发起式": [
    "023389",
    "023390"
  ],
  "南方港股医药行业混合发起(QDII)": [
    "019415",
    "019416"
  ],
  "南方中证国新港股通央企红利ETF发起联接": [
    "021971",
    "021972"
  ],
  "华宝标普港股通低波红利ETF联接": [
    "022887",
    "022888"
  ],
  "汇添富恒生港股通中国科技ETF": [
    "520980"
  ],
  "格林港股通臻选混合": [
    "017000",
    "017001"
  ],
  "华宝标普港股通低波红利ETF": [
    "159220"
  ],
  "永赢中证港股通医疗主题ETF": [
    "159366"
  ],
  "平安港股通红利优选混合": [
    "022748",
    "022749"
  ],
  "鹏华国证港股通消费主题ETF": [
    "159265"
  ],
  "万家中证港股通央企红利ETF联接": [
    "023572",
    "023573"
  ],
  "国泰中证港股通高股息投资ETF发起联接": [
    "022274",
    "022275"
  ],
  "华宝恒生港股通创新药精选ETF": [
    "520880"
  ],
  "华泰柏瑞港股通红利ETF联接基金I": [
    "022663"
  ],
  "平安港股通医疗创新精选混合": [
    "024379",
    "024380"
  ],
  "华夏中证港股通50ETF发起式联接": [
    "018721",
    "018722"
  ],
  "国投瑞银中证港股通央企红利指数发起式": [
    "022151",
    "022152"
  ],
  "南方中证港股通科技ETF": [
    "159269"
  ],
  "富国恒生港股通汽车主题ETF": [
    "159239"
  ],
  "鹏华中证港股通医药卫生ETF发起式联接": [
    "021088",
    "021089"
  ],
  "易方达恒生港股通创新药ETF联接发起式": [
    "024328",
    "024329"
  ],
  "港股汽车ETF基金": [
    "159237"
  ],
  "易方达中证港股通中国100ETF联接发起式": [
    "019408",
    "019409"
  ],
  "长城中证港股通高股息指数发起(QDII)": [
    "022325",
    "022326"
  ],
  "汇添富中证港股通汽车产业主题ETF": [
    "159210"
  ],
  "广发中证国新港股通央企红利ETF发起式联接": [
    "022719",
    "022720"
  ],
  "中欧聚优港股通混合发起": [
    "018105",
    "018106"
  ],
  "鹏华恒生港股通高股息率指数发起式": [
    "023070",
    "023071"
  ],
  "华安恒指港股通ETF": [
    "520940"
  ],
  "万家国证港股通科技ETF": [
    "159251"
  ],
  "富国恒指港股通ETF": [
    "159365"
  ],
  "汇添富国证港股通消费主题ETF": [
    "159268"
  ],
  "中银中证港股通高股息投资指数": [
    "023104",
    "023105"
  ],
  "招商恒生港股通高股息低波动ETF发起式联接": [
    "024029",
    "024030"
  ],
  "工银中证港股通高股息精选ETF联接": [
    "024247",
    "024248"
  ],
  "永赢中证港股通央企红利ETF": [
    "159266"
  ],
  "国泰君安中证港股通高股息投资指数发起(QDII)": [
    "023073",
    "023074"
  ],
  "恒生前海港股通价值混合": [
    "022693",
    "022694"
  ],
  "兴银中证港股通科技ETF发起式联接": [
    "023505",
    "023506"
  ],
  "富国中证港股通科技ETF": [
    "520860"
  ],
  "银华恒生港股通中国科技ETF发起式联接": [
    "024037",
    "024038"
  ],
  "鹏华中证港股通消费ETF联接I": [
    "022793"
  ],
  "华富中证港股通创新药指数型发起式": [
    "024363",
    "024364"
  ],
  "鹏华中证港股通医药卫生ETF发起式联接I": [
    "022844"
  ],
  "华泰柏瑞港股通医疗精选混合发起式": [
    "019126",
    "019127"
  ],
  "浦银安盛港股通央企红利混合": [
    "024398",
    "024399"
  ],
  "华夏中证港股通医疗主题ETF": [
    "520510"
  ],
  "银华恒生港股通中国科技ETF发起式联接I": [
    "024039"
  ],
  "大成港股通机遇混合": [
    "024159",
    "024160"
  ],
  "嘉实中证港股通创新药ETF": [
    "520970"
  ],
  "广发中证港股通汽车ETF发起式联接": [
    "024381",
    "024382"
  ],
  "鑫元中证港股通创新药指数发起式": [
    "024407",
    "024408"
  ],
  "东方红港股通价值优选混合发起": [
    "024044",
    "024045"
  ],
  "鹏华中证港股通科技ETF发起式联接I": [
    "022884"
  ],
  "华泰柏瑞中证港股通科技ETF发起式联接": [
    "024739",
    "024740"
  ],
  "鹏华恒生港股通高股息率指数发起式I": [
    "024140"
  ],
  "富国中证港股通高股息投资ETF": [
    "159277"
  ],
  "前海开源港股通价值领航混合": [
    "023623",
    "023624"
  ],
  "平安中证港股医药ETF联接E": [
    "024544"
  ],
  "博时恒生港股通创新药精选ETF": [
    "520690"
  ],
  "华夏中证港股通汽车产业主题ETF发起式联接": [
    "024144",
    "024145"
  ],
  "富达港股通精选混合发起": [
    "023899",
    "023900"
  ],
  "嘉实中证港股通高股息投资ETF发起联接": [
    "024705",
    "024706"
  ],
  "汇添富港股通红利回报混合发起式": [
    "024786",
    "024787"
  ],
  "富国恒生港股通汽车主题ETF发起式联接": [
    "024864",
    "024865"
  ],
  "东方红中证港股通高股息投资指数": [
    "024227",
    "024228"
  ],
  "天弘中证港股通高股息投资指数发起E": [
    "024754"
  ],
  "中航恒宇港股通价值优选混合发起": [
    "019309",
    "019310"
  ]
};

//  获取基金净值
async function NetValue(fundCode) {
  let netValueList = '';
  try {
    let u = `https://ms.jr.jd.com/gw/generic/jj/h5/m/getFundHistoryNetValuePageInfo`;

    let response = await fetch(u, {
      headers: {
        accept: 'application/json, text/plain, */*',
        'accept-language': 'zh-CN,zh;q=0.9,en;q=0.8',
        'content-type': 'application/x-www-form-urlencoded',
      },
      body: `reqData={"fundCode":"${fundCode}","pageNum":1,"pageSize":730,"channel":"9"}`,
      method: 'POST',
    });
    const res = (await response.json()) || {};
    netValueList = res?.resultData?.datas?.netValueList || [];
  } catch (err) {
    console.log(`累计净值--{${fundCode}}--err => `);
  }
  return netValueList;
}

async function aaa() {
  let arr = Object.keys(obj).map(key => obj[key][0]);// 获取所有的基金号
  let len = arr.length;
  // 过滤完成code数组
  fs.writeFile(`./filter_end_code.json`, JSON.stringify({code:arr}), (err) => {
    if (err) {
      console.error(err);
      return;
    }
  })

  for (let i = 0; i < len; i++) {
    let netValueList = await NetValue(arr[i]);
    if (netValueList.length >= 300) {
      // 将 JSON 字符串写入文件
      fs.writeFile(`./fundData/${arr[i]}.json`, JSON.stringify(netValueList), (err) => {
        if (err) {
          console.error(err);
          return;
        }
      })
    }
  }
  console.log('全部完成')
}
aaa()


