var arr = [
  {
    "code": "005583",
    "name": "易方达港股通红利混合"
  },
  {
    "code": "501311",
    "name": "嘉实港股通新经济指数A"
  },
  {
    "code": "009896",
    "name": "广发港股通成长精选股票A",
    "c-code": "009897"
  },
  {
    "code": "005051",
    "name": "摩根标普港股通低波红利指数A",
    "c-code": "005052"
  },
  {
    "code": "040018",
    "name": "华安香港精选股票(QDII)"
  },
  {
    "code": "006614",
    "name": "嘉实港股通新经济指数C"
  },
  {
    "code": "010041",
    "name": "嘉实港股优势混合A"
  },
  {
    "code": "160322",
    "name": "华夏港股通精选股票发起式(LOF)A"
  },
  {
    "code": "513010",
    "name": "易方达恒生科技(QDII-ETF)"
  },
  {
    "code": "501301",
    "name": "华宝香港大盘A"
  },
  {
    "code": "161124",
    "name": "易方达香港小型股指数A"
  },
  {
    "code": "501025",
    "name": "鹏华香港银行指数(LOF)A"
  },
  {
    "code": "005228",
    "name": "汇添富港股通专注成长"
  },
  {
    "code": "513550",
    "name": "华泰柏瑞中证港股通50ETF"
  },
  {
    "code": "014674",
    "name": "富国中证港股通互联网ETF发起式联接C"
  },
  {
    "code": "011162",
    "name": "博时港股通领先趋势混合A"
  },
  {
    "code": "007110",
    "name": "国投瑞银港股通混合A"
  },
  {
    "code": "012346",
    "name": "易方达港股通成长混合A"
  },
  {
    "code": "159741",
    "name": "嘉实恒生科技ETF(QDII)"
  },
  {
    "code": "006595",
    "name": "广发港股通优质增长混合A"
  },
  {
    "code": "501305",
    "name": "汇添富港股红利ETF联接A"
  },
  {
    "code": "009846",
    "name": "国富港股通远见价值混合A"
  },
  {
    "code": "006753",
    "name": "天弘港股通精选C"
  },
  {
    "code": "159792",
    "name": "富国中证港股通互联网ETF"
  },
  {
    "code": "513120",
    "name": "广发中证香港创新药ETF(QDII)"
  },
  {
    "code": "010042",
    "name": "嘉实港股优势混合C"
  },
  {
    "code": "012588",
    "name": "南方港股通优势企业混合A"
  },
  {
    "code": "004098",
    "name": "前海开源港股通股息率50强"
  },
  {
    "code": "501306",
    "name": "汇添富港股红利ETF联接C"
  },
  {
    "code": "513900",
    "name": "华安CES港股通ETF"
  },
  {
    "code": "007291",
    "name": "汇丰晋信港股通双核策略混合"
  },
  {
    "code": "006752",
    "name": "天弘港股通精选A"
  },
  {
    "code": "513980",
    "name": "景顺长城中证港股通科技ETF"
  },
  {
    "code": "011925",
    "name": "嘉实港股互联网产业核心资产C"
  },
  {
    "code": "009983",
    "name": "永赢港股通品质生活慧选混合A"
  },
  {
    "code": "513530",
    "name": "华泰柏瑞中证港股通高股息投资ETF(QDII)"
  },
  {
    "code": "011163",
    "name": "博时港股通领先趋势混合C"
  },
  {
    "code": "007216",
    "name": "浙商中华预期高股息C"
  },
  {
    "code": "007178",
    "name": "浙商中华预期高股息A"
  },
  {
    "code": "513630",
    "name": "摩根标普港股通低波红利ETF"
  },
  {
    "code": "012347",
    "name": "易方达港股通成长混合C"
  },
  {
    "code": "501303",
    "name": "广发恒生中型股指数(LOF)A"
  },
  {
    "code": "159691",
    "name": "工银瑞信中证港股通高股息精选ETF"
  },
  {
    "code": "513700",
    "name": "鹏华中证港股通医药卫生综合交易ETF"
  },
  {
    "code": "021031",
    "name": "汇添富国证港股通创新药ETF发起式联接C"
  },
  {
    "code": "011635",
    "name": "富国港股通策略精选混合A"
  },
  {
    "code": "513820",
    "name": "汇添富中证港股通高股息投资ETF"
  },
  {
    "code": "159545",
    "name": "易方达恒生港股通高股息低波动ETF"
  },
  {
    "code": "513950",
    "name": "富国恒生港股通高股息低波动ETF(QDII)"
  },
  {
    "code": "513910",
    "name": "华夏中证港股通央企红利ETF"
  },
  {
    "code": "014673",
    "name": "富国中证港股通互联网ETF发起式联接A"
  },
  {
    "code": "017650",
    "name": "中庚港股通价值股票"
  },
  {
    "code": "011356",
    "name": "华泰柏瑞港股通时代机遇混合C"
  },
  {
    "code": "513770",
    "name": "华宝中证港股通互联网ETF"
  },
  {
    "code": "011924",
    "name": "嘉实港股互联网产业核心资产A"
  },
  {
    "code": "009017",
    "name": "银华港股通精选股票发起式A"
  },
  {
    "code": "006787",
    "name": "泰康港股通大消费指数C"
  },
  {
    "code": "006786",
    "name": "泰康港股通大消费指数A"
  },
  {
    "code": "159960",
    "name": "平安港股通恒生中国企业ETF"
  },
  {
    "code": "006355",
    "name": "华宝香港大盘C"
  },
  {
    "code": "513860",
    "name": "海富通中证港股通科技ETF"
  },
  {
    "code": "513990",
    "name": "招商上证港股通ETF"
  },
  {
    "code": "007354",
    "name": "创金合信港股通量化股票A"
  },
  {
    "code": "513200",
    "name": "易方达中证港股通医药卫生综合ETF"
  },
  {
    "code": "017126",
    "name": "华宝中证港股通互联网ETF发起联接C"
  },
  {
    "code": "005707",
    "name": "富国港股通量化精选股票A"
  },
  {
    "code": "005269",
    "name": "华泰柏瑞港股通量化混合A"
  },
  {
    "code": "012379",
    "name": "创金合信港股互联网3个月持有期混合(QDII)A"
  },
  {
    "code": "513020",
    "name": "国泰中证港股通科技ETF"
  },
  {
    "code": "011355",
    "name": "华泰柏瑞港股通时代机遇混合A"
  },
  {
    "code": "513920",
    "name": "华安恒生港股通中国央企红利ETF"
  },
  {
    "code": "004532",
    "name": "民生加银港股通高股息A"
  },
  {
    "code": "159570",
    "name": "汇添富国证港股通创新药ETF"
  },
  {
    "code": "005701",
    "name": "摩根香港精选港股通混合A"
  },
  {
    "code": "159735",
    "name": "银华中证港股通消费主题ETF"
  },
  {
    "code": "159636",
    "name": "工银瑞信国证港股通科技30ETF"
  },
  {
    "code": "020398",
    "name": "中银港股通医药混合发起C"
  },
  {
    "code": "004533",
    "name": "民生加银港股通高股息C"
  },
  {
    "code": "159615",
    "name": "南方恒生生物科技ETF(QDII)"
  },
  {
    "code": "006537",
    "name": "恒生前海港股通精选混合"
  },
  {
    "code": "012208",
    "name": "华夏港股前沿经济混合(QDII)A"
  },
  {
    "code": "006781",
    "name": "汇丰晋信港股通精选股票"
  },
  {
    "code": "012227",
    "name": "景顺长城港股通全球竞争力A"
  },
  {
    "code": "007132",
    "name": "长城港股通价值精选混合A"
  },
  {
    "code": "513160",
    "name": "银华恒生港股通中国科技ETF"
  },
  {
    "code": "005255",
    "name": "浦银安盛港股通量化混合A"
  },
  {
    "code": "159567",
    "name": "银华国证港股通创新药ETF"
  },
  {
    "code": "018388",
    "name": "华泰柏瑞港股通红利ETF联接基金C"
  },
  {
    "code": "016496",
    "name": "景顺长城中证港股通科技ETF发起联接C"
  },
  {
    "code": "012372",
    "name": "东财中证沪港深互联网ETF发起式联接C"
  },
  {
    "code": "520990",
    "name": "景顺长城中证国新港股通央企红利ETF"
  },
  {
    "code": "010204",
    "name": "中银港股通优势成长股票"
  },
  {
    "code": "513070",
    "name": "易方达中证港股通消费主题ETF"
  },
  {
    "code": "520550",
    "name": "招商恒生港股通高股息低波动ETF"
  },
  {
    "code": "513590",
    "name": "鹏华中证港股通消费主题ETF"
  },
  {
    "code": "159718",
    "name": "平安中证港股通医药卫生综合ETF"
  },
  {
    "code": "513280",
    "name": "汇添富恒生生物科技ETF(QDII)"
  },
  {
    "code": "520900",
    "name": "广发中证国新港股通央企红利ETF"
  },
  {
    "code": "018558",
    "name": "易方达港股通医药ETF联接C"
  },
  {
    "code": "019260",
    "name": "富国恒生红利ETF联接A"
  },
  {
    "code": "513750",
    "name": "广发中证港股通非银ETF"
  },
  {
    "code": "159751",
    "name": "鹏华中证港股通科技ETF"
  },
  {
    "code": "020111",
    "name": "富国恒生港股通医疗保健ETF发起式联接C"
  },
  {
    "code": "021760",
    "name": "中欧中证港股通创新药指数发起C"
  },
  {
    "code": "013991",
    "name": "中欧港股通精选一年持有混合A"
  },
  {
    "code": "006106",
    "name": "景顺长城量化港股通股票A"
  },
  {
    "code": "159506",
    "name": "富国恒生港股通医疗保健ETF"
  },
  {
    "code": "159776",
    "name": "银华中证港股通医药卫生综合ETF"
  },
  {
    "code": "012589",
    "name": "南方港股通优势企业混合C"
  },
  {
    "code": "513230",
    "name": "华夏中证港股通消费主题ETF"
  },
  {
    "code": "015740",
    "name": "国泰中证港股通科技ETF发起联接C"
  },
  {
    "code": "014746",
    "name": "贝莱德港股通远景视野混合A"
  },
  {
    "code": "520660",
    "name": "南方中证国新港股通央企红利ETF"
  },
  {
    "code": "018387",
    "name": "华泰柏瑞港股通红利ETF联接基金A"
  },
  {
    "code": "012380",
    "name": "创金合信港股互联网3个月持有期混合(QDII)C"
  },
  {
    "code": "017973",
    "name": "易方达港股通优质增长混合A"
  },
  {
    "code": "159333",
    "name": "万家中证港股通央企红利ETF"
  },
  {
    "code": "016297",
    "name": "中欧丰泰港股通混合A"
  },
  {
    "code": "021457",
    "name": "易方达恒生红利低波ETF联接A"
  },
  {
    "code": "513040",
    "name": "易方达中证港股通互联网ETF"
  },
  {
    "code": "014519",
    "name": "博时恒生高股息率ETF发起式联接A"
  },
  {
    "code": "015885",
    "name": "中欧港股数字经济混合发起(QDII)C"
  },
  {
    "code": "513190",
    "name": "华夏中证港股通内地金融ETF"
  },
  {
    "code": "021142",
    "name": "华夏港股通央企红利ETF联接A"
  },
  {
    "code": "005813",
    "name": "华安CES港股通ETF联接A"
  },
  {
    "code": "513560",
    "name": "兴银中证港股通科技ETF"
  },
  {
    "code": "021143",
    "name": "华夏港股通央企红利ETF联接C"
  },
  {
    "code": "019314",
    "name": "易方达中证港股通互联网ETF发起式联接C"
  },
  {
    "code": "021030",
    "name": "汇添富国证港股通创新药ETF发起式联接A"
  },
  {
    "code": "011636",
    "name": "富国港股通策略精选混合C"
  },
  {
    "code": "513320",
    "name": "易方达恒生港股通新经济ETF"
  },
  {
    "code": "513150",
    "name": "华泰柏瑞港股通科技ETF"
  },
  {
    "code": "159711",
    "name": "华夏中证港股通50ETF"
  },
  {
    "code": "159569",
    "name": "景顺长城国证港股通红利低波动率ETF"
  },
  {
    "code": "012209",
    "name": "华夏港股前沿经济混合(QDII)C"
  },
  {
    "code": "020397",
    "name": "中银港股通医药混合发起A"
  },
  {
    "code": "011583",
    "name": "大成港股精选混合(QDII)A"
  },
  {
    "code": "159712",
    "name": "国泰中证港股通50ETF"
  },
  {
    "code": "159331",
    "name": "国泰中证港股通高股息投资ETF"
  },
  {
    "code": "005814",
    "name": "华安CES港股通ETF联接C"
  },
  {
    "code": "018104",
    "name": "易方达中证港股通消费主题ETF发起式联接C"
  },
  {
    "code": "520890",
    "name": "华泰柏瑞恒生港股通高股息低波动ETF"
  },
  {
    "code": "014520",
    "name": "博时恒生高股息率ETF发起式联接C"
  },
  {
    "code": "012228",
    "name": "景顺长城港股通全球竞争力C"
  },
  {
    "code": "159788",
    "name": "易方达中证港股通中国100ETF"
  },
  {
    "code": "018103",
    "name": "易方达中证港股通消费主题ETF发起式联接A"
  },
  {
    "code": "012586",
    "name": "南方港股创新视野一年持有混合A"
  },
  {
    "code": "010093",
    "name": "西部利得港股通新机遇混合C"
  },
  {
    "code": "014747",
    "name": "贝莱德港股通远景视野混合C"
  },
  {
    "code": "513780",
    "name": "景顺长城中证港股通创新药ETF"
  },
  {
    "code": "159302",
    "name": "银华中证港股高股息ETF"
  },
  {
    "code": "159568",
    "name": "博时港股通互联网ETF"
  },
  {
    "code": "013009",
    "name": "万家港股通精选混合A"
  },
  {
    "code": "011081",
    "name": "国投瑞银港股通混合C"
  },
  {
    "code": "011584",
    "name": "大成港股精选混合(QDII)C"
  },
  {
    "code": "016495",
    "name": "景顺长城中证港股通科技ETF发起联接A"
  },
  {
    "code": "015884",
    "name": "中欧港股数字经济混合发起(QDII)A"
  },
  {
    "code": "159316",
    "name": "易方达恒生港股通创新药ETF"
  },
  {
    "code": "008861",
    "name": "西部利得港股通新机遇混合A"
  },
  {
    "code": "022701",
    "name": "睿远港股通核心价值混合C"
  },
  {
    "code": "016298",
    "name": "中欧丰泰港股通混合C"
  },
  {
    "code": "017125",
    "name": "华宝中证港股通互联网ETF发起联接A"
  },
  {
    "code": "018557",
    "name": "易方达港股通医药ETF联接A"
  },
  {
    "code": "021047",
    "name": "平安港股通红利精选混合发起式C"
  },
  {
    "code": "020501",
    "name": "广发中证港股通非银ETF发起式联接C"
  },
  {
    "code": "023598",
    "name": "景顺长城中证港股通创新药ETF联接C"
  },
  {
    "code": "011651",
    "name": "招商港股通核心精选股票A"
  },
  {
    "code": "520700",
    "name": "万家中证港股通创新药ETF"
  },
  {
    "code": "017833",
    "name": "华夏中证港股通消费主题ETF发起式联接C"
  },
  {
    "code": "019934",
    "name": "工银国证港股通科技ETF发起式联接C"
  },
  {
    "code": "021378",
    "name": "兴业中证港股通互联网指数发起式C"
  },
  {
    "code": "007357",
    "name": "创金合信港股通量化股票C"
  },
  {
    "code": "004996",
    "name": "广发恒生中型股指数C"
  },
  {
    "code": "021465",
    "name": "海富通中证港股通科技ETF发起联接C"
  },
  {
    "code": "017974",
    "name": "易方达港股通优质增长混合C"
  },
  {
    "code": "520600",
    "name": "广发中证港股通汽车ETF"
  },
  {
    "code": "159217",
    "name": "工银国证港股通创新药ETF"
  },
  {
    "code": "013010",
    "name": "万家港股通精选混合C"
  },
  {
    "code": "015739",
    "name": "国泰中证港股通科技ETF发起联接A"
  },
  {
    "code": "019313",
    "name": "易方达中证港股通互联网ETF发起式联接A"
  },
  {
    "code": "013392",
    "name": "广发港股通优质增长混合C"
  },
  {
    "code": "011969",
    "name": "建信港股通精选混合A"
  },
  {
    "code": "011970",
    "name": "建信港股通精选混合C"
  },
  {
    "code": "019266",
    "name": "南方港股数字经济混合发起(QDII)C"
  },
  {
    "code": "021961",
    "name": "景顺长城中证国新港股通央企红利ETF联接A"
  },
  {
    "code": "016953",
    "name": "鹏华中证港股通消费ETF联接C"
  },
  {
    "code": "014163",
    "name": "富国港股通量化精选股票C"
  },
  {
    "code": "020867",
    "name": "华安恒生港股通中国央企红利ETF发起式联接C"
  },
  {
    "code": "013224",
    "name": "浦银安盛港股通量化混合C"
  },
  {
    "code": "022700",
    "name": "睿远港股通核心价值混合A"
  },
  {
    "code": "020866",
    "name": "华安恒生港股通中国央企红利ETF发起式联接A"
  },
  {
    "code": "011315",
    "name": "永赢港股通优质成长一年混合"
  },
  {
    "code": "010010",
    "name": "国投瑞银港股通6个月定开股票"
  },
  {
    "code": "159323",
    "name": "华夏中证港股通汽车产业主题ETF"
  },
  {
    "code": "020500",
    "name": "广发中证港股通非银ETF发起式联接A"
  },
  {
    "code": "021093",
    "name": "广发中证港股通互联网指数发起式C"
  },
  {
    "code": "159262",
    "name": "广发恒生港股通科技主题ETF"
  },
  {
    "code": "021584",
    "name": "中欧中证港股通央企红利指数发起(QDII)C"
  },
  {
    "code": "016952",
    "name": "鹏华中证港股通消费ETF联接A"
  },
  {
    "code": "017832",
    "name": "华夏中证港股通消费主题ETF发起式联接A"
  },
  {
    "code": "021377",
    "name": "兴业中证港股通互联网指数发起式A"
  },
  {
    "code": "022751",
    "name": "南方中证港股通汽车产业主题指数发起C"
  },
  {
    "code": "020110",
    "name": "富国恒生港股通医疗保健ETF发起式联接A"
  },
  {
    "code": "017627",
    "name": "长城港股通价值精选混合C"
  },
  {
    "code": "013992",
    "name": "中欧港股通精选一年持有混合C"
  },
  {
    "code": "012884",
    "name": "华夏港股通精选股票发起式(LOF)C"
  },
  {
    "code": "513830",
    "name": "嘉实中证港股通高股息投资ETF"
  },
  {
    "code": "020423",
    "name": "华夏中证港股通内地金融ETF发起式联接C"
  },
  {
    "code": "021295",
    "name": "鹏华中证港股通科技ETF发起式联接C"
  },
  {
    "code": "159318",
    "name": "银华恒指港股通ETF"
  },
  {
    "code": "021514",
    "name": "富国港股通红利精选混合C"
  },
  {
    "code": "159312",
    "name": "广发恒指港股通ETF"
  },
  {
    "code": "019265",
    "name": "南方港股数字经济混合发起(QDII)A"
  },
  {
    "code": "019598",
    "name": "平安中证港股医药ETF联接A"
  },
  {
    "code": "019933",
    "name": "工银国证港股通科技ETF发起式联接A"
  },
  {
    "code": "021892",
    "name": "融通中证港股通科技指数C"
  },
  {
    "code": "023482",
    "name": "万家中证港股通创新药ETF发起式联接C"
  },
  {
    "code": "021759",
    "name": "中欧中证港股通创新药指数发起A"
  },
  {
    "code": "023410",
    "name": "天弘恒生港股通高股息低波动指数A"
  },
  {
    "code": "021962",
    "name": "景顺长城中证国新港股通央企红利ETF联接C"
  },
  {
    "code": "021513",
    "name": "富国港股通红利精选混合A"
  },
  {
    "code": "021583",
    "name": "中欧中证港股通央企红利指数发起(QDII)A"
  },
  {
    "code": "021046",
    "name": "平安港股通红利精选混合发起式A"
  },
  {
    "code": "023930",
    "name": "银华国证港股通创新药ETF发起式联接C"
  },
  {
    "code": "021891",
    "name": "融通中证港股通科技指数A"
  },
  {
    "code": "021092",
    "name": "广发中证港股通互联网指数发起式A"
  },
  {
    "code": "020422",
    "name": "华夏中证港股通内地金融ETF发起式联接A"
  },
  {
    "code": "159245",
    "name": "富国国证港股通消费主题ETF"
  },
  {
    "code": "022073",
    "name": "天弘中证港股通高股息投资指数发起C"
  },
  {
    "code": "023389",
    "name": "易方达中证港股通高股息投资指数发起式A"
  },
  {
    "code": "019415",
    "name": "南方港股医药行业混合发起(QDII)A"
  },
  {
    "code": "021971",
    "name": "南方中证国新港股通央企红利ETF发起联接A"
  },
  {
    "code": "022072",
    "name": "天弘中证港股通高股息投资指数发起A"
  },
  {
    "code": "022888",
    "name": "华宝标普港股通低波红利ETF联接C"
  },
  {
    "code": "022887",
    "name": "华宝标普港股通低波红利ETF联接A"
  },
  {
    "code": "016921",
    "name": "摩根香港精选港股通混合C"
  },
  {
    "code": "520980",
    "name": "汇添富恒生港股通中国科技ETF"
  },
  {
    "code": "017001",
    "name": "格林港股通臻选混合C"
  },
  {
    "code": "159220",
    "name": "华宝标普港股通低波红利ETF"
  },
  {
    "code": "159366",
    "name": "永赢中证港股通医疗主题ETF"
  },
  {
    "code": "012587",
    "name": "南方港股创新视野一年持有混合C"
  },
  {
    "code": "021294",
    "name": "鹏华中证港股通科技ETF发起式联接A"
  },
  {
    "code": "011652",
    "name": "招商港股通核心精选股票C"
  },
  {
    "code": "022749",
    "name": "平安港股通红利优选混合C"
  },
  {
    "code": "159265",
    "name": "鹏华国证港股通消费主题ETF"
  },
  {
    "code": "022748",
    "name": "平安港股通红利优选混合A"
  },
  {
    "code": "023573",
    "name": "万家中证港股通央企红利ETF联接C"
  },
  {
    "code": "023597",
    "name": "景顺长城中证港股通创新药ETF联接A"
  },
  {
    "code": "022275",
    "name": "国泰中证港股通高股息投资ETF发起联接C"
  },
  {
    "code": "520880",
    "name": "华宝恒生港股通创新药精选ETF"
  },
  {
    "code": "022663",
    "name": "华泰柏瑞港股通红利ETF联接基金I"
  },
  {
    "code": "024380",
    "name": "平安港股通医疗创新精选混合C"
  },
  {
    "code": "023411",
    "name": "天弘恒生港股通高股息低波动指数C"
  },
  {
    "code": "018722",
    "name": "华夏中证港股通50ETF发起式联接C"
  },
  {
    "code": "022151",
    "name": "国投瑞银中证港股通央企红利指数发起式A"
  },
  {
    "code": "024379",
    "name": "平安港股通医疗创新精选混合A"
  },
  {
    "code": "159269",
    "name": "南方中证港股通科技ETF"
  },
  {
    "code": "159239",
    "name": "富国恒生港股通汽车主题ETF"
  },
  {
    "code": "018861",
    "name": "景顺长城量化港股通股票C"
  },
  {
    "code": "021089",
    "name": "鹏华中证港股通医药卫生ETF发起式联接C"
  },
  {
    "code": "022750",
    "name": "南方中证港股通汽车产业主题指数发起A"
  },
  {
    "code": "024329",
    "name": "易方达恒生港股通创新药ETF联接发起式C"
  },
  {
    "code": "021464",
    "name": "海富通中证港股通科技ETF发起联接A"
  },
  {
    "code": "159237",
    "name": "港股汽车ETF基金"
  },
  {
    "code": "019408",
    "name": "易方达中证港股通中国100ETF联接发起式A"
  },
  {
    "code": "021972",
    "name": "南方中证国新港股通央企红利ETF发起联接C"
  },
  {
    "code": "022325",
    "name": "长城中证港股通高股息指数发起(QDII)A"
  },
  {
    "code": "018721",
    "name": "华夏中证港股通50ETF发起式联接A"
  },
  {
    "code": "159210",
    "name": "汇添富中证港股通汽车产业主题ETF"
  },
  {
    "code": "014052",
    "name": "银华港股通精选股票发起式C"
  },
  {
    "code": "023390",
    "name": "易方达中证港股通高股息投资指数发起式C"
  },
  {
    "code": "024328",
    "name": "易方达恒生港股通创新药ETF联接发起式A"
  },
  {
    "code": "022720",
    "name": "广发中证国新港股通央企红利ETF发起式联接C"
  },
  {
    "code": "018105",
    "name": "中欧聚优港股通混合发起A"
  },
  {
    "code": "023572",
    "name": "万家中证港股通央企红利ETF联接A"
  },
  {
    "code": "023070",
    "name": "鹏华恒生港股通高股息率指数发起式A"
  },
  {
    "code": "018106",
    "name": "中欧聚优港股通混合发起C"
  },
  {
    "code": "520940",
    "name": "华安恒指港股通ETF"
  },
  {
    "code": "022274",
    "name": "国泰中证港股通高股息投资ETF发起联接A"
  },
  {
    "code": "159251",
    "name": "万家国证港股通科技ETF"
  },
  {
    "code": "023929",
    "name": "银华国证港股通创新药ETF发起式联接A"
  },
  {
    "code": "022719",
    "name": "广发中证国新港股通央企红利ETF发起式联接A"
  },
  {
    "code": "021088",
    "name": "鹏华中证港股通医药卫生ETF发起式联接A"
  },
  {
    "code": "022152",
    "name": "国投瑞银中证港股通央企红利指数发起式C"
  },
  {
    "code": "023481",
    "name": "万家中证港股通创新药ETF发起式联接A"
  },
  {
    "code": "159365",
    "name": "富国恒指港股通ETF"
  },
  {
    "code": "159268",
    "name": "汇添富国证港股通消费主题ETF"
  },
  {
    "code": "023104",
    "name": "中银中证港股通高股息投资指数A"
  },
  {
    "code": "021710",
    "name": "华泰柏瑞港股通量化混合C"
  },
  {
    "code": "017000",
    "name": "格林港股通臻选混合A"
  },
  {
    "code": "024029",
    "name": "招商恒生港股通高股息低波动ETF发起式联接A"
  },
  {
    "code": "024247",
    "name": "工银中证港股通高股息精选ETF联接A"
  },
  {
    "code": "159266",
    "name": "永赢中证港股通央企红利ETF"
  },
  {
    "code": "023073",
    "name": "国泰君安中证港股通高股息投资指数发起(QDII)A"
  },
  {
    "code": "023074",
    "name": "国泰君安中证港股通高股息投资指数发起(QDII)C"
  },
  {
    "code": "022693",
    "name": "恒生前海港股通价值混合A"
  },
  {
    "code": "023071",
    "name": "鹏华恒生港股通高股息率指数发起式C"
  },
  {
    "code": "023506",
    "name": "兴银中证港股通科技ETF发起式联接C"
  },
  {
    "code": "017947",
    "name": "国富港股通远见价值混合C"
  },
  {
    "code": "022694",
    "name": "恒生前海港股通价值混合C"
  },
  {
    "code": "024030",
    "name": "招商恒生港股通高股息低波动ETF发起式联接C"
  },
  {
    "code": "021918",
    "name": "永赢港股通品质生活慧选混合C"
  },
  {
    "code": "023105",
    "name": "中银中证港股通高股息投资指数C"
  },
  {
    "code": "022326",
    "name": "长城中证港股通高股息指数发起(QDII)C"
  },
  {
    "code": "520860",
    "name": "富国中证港股通科技ETF"
  },
  {
    "code": "023505",
    "name": "兴银中证港股通科技ETF发起式联接A"
  },
  {
    "code": "024248",
    "name": "工银中证港股通高股息精选ETF联接C"
  },
  {
    "code": "024037",
    "name": "银华恒生港股通中国科技ETF发起式联接A"
  },
  {
    "code": "022793",
    "name": "鹏华中证港股通消费ETF联接I"
  },
  {
    "code": "024364",
    "name": "华富中证港股通创新药指数型发起式C"
  },
  {
    "code": "024038",
    "name": "银华恒生港股通中国科技ETF发起式联接C"
  },
  {
    "code": "022844",
    "name": "鹏华中证港股通医药卫生ETF发起式联接I"
  },
  {
    "code": "019126",
    "name": "华泰柏瑞港股通医疗精选混合发起式A"
  },
  {
    "code": "024363",
    "name": "华富中证港股通创新药指数型发起式A"
  },
  {
    "code": "024398",
    "name": "浦银安盛港股通央企红利混合A"
  },
  {
    "code": "520510",
    "name": "华夏中证港股通医疗主题ETF"
  },
  {
    "code": "024039",
    "name": "银华恒生港股通中国科技ETF发起式联接I"
  },
  {
    "code": "024159",
    "name": "大成港股通机遇混合A"
  },
  {
    "code": "520970",
    "name": "嘉实中证港股通创新药ETF"
  },
  {
    "code": "024381",
    "name": "广发中证港股通汽车ETF发起式联接A"
  },
  {
    "code": "024407",
    "name": "鑫元中证港股通创新药指数发起式A"
  },
  {
    "code": "024044",
    "name": "东方红港股通价值优选混合发起A"
  },
  {
    "code": "022884",
    "name": "鹏华中证港股通科技ETF发起式联接I"
  },
  {
    "code": "019127",
    "name": "华泰柏瑞港股通医疗精选混合发起式C"
  },
  {
    "code": "024739",
    "name": "华泰柏瑞中证港股通科技ETF发起式联接A"
  },
  {
    "code": "024140",
    "name": "鹏华恒生港股通高股息率指数发起式I"
  },
  {
    "code": "159277",
    "name": "富国中证港股通高股息投资ETF"
  },
  {
    "code": "023623",
    "name": "前海开源港股通价值领航混合A"
  },
  {
    "code": "024544",
    "name": "平安中证港股医药ETF联接E"
  },
  {
    "code": "520690",
    "name": "博时恒生港股通创新药精选ETF"
  },
  {
    "code": "024408",
    "name": "鑫元中证港股通创新药指数发起式C"
  },
  {
    "code": "024382",
    "name": "广发中证港股通汽车ETF发起式联接C"
  },
  {
    "code": "024144",
    "name": "华夏中证港股通汽车产业主题ETF发起式联接A"
  },
  {
    "code": "024160",
    "name": "大成港股通机遇混合C"
  },
  {
    "code": "023899",
    "name": "富达港股通精选混合发起A"
  },
  {
    "code": "024399",
    "name": "浦银安盛港股通央企红利混合C"
  },
  {
    "code": "024740",
    "name": "华泰柏瑞中证港股通科技ETF发起式联接C"
  },
  {
    "code": "023624",
    "name": "前海开源港股通价值领航混合C"
  },
  {
    "code": "019599",
    "name": "平安中证港股医药ETF联接C"
  },
  {
    "code": "023900",
    "name": "富达港股通精选混合发起C"
  },
  {
    "code": "024705",
    "name": "嘉实中证港股通高股息投资ETF发起联接A"
  },
  {
    "code": "024786",
    "name": "汇添富港股通红利回报混合发起式A"
  },
  {
    "code": "024145",
    "name": "华夏中证港股通汽车产业主题ETF发起式联接C"
  },
  {
    "code": "024045",
    "name": "东方红港股通价值优选混合发起C"
  },
  {
    "code": "024864",
    "name": "富国恒生港股通汽车主题ETF发起式联接A"
  },
  {
    "code": "024706",
    "name": "嘉实中证港股通高股息投资ETF发起联接C"
  },
  {
    "code": "024227",
    "name": "东方红中证港股通高股息投资指数A"
  },
  {
    "code": "024754",
    "name": "天弘中证港股通高股息投资指数发起E"
  },
  {
    "code": "019309",
    "name": "中航恒宇港股通价值优选混合发起A"
  },
  {
    "code": "024787",
    "name": "汇添富港股通红利回报混合发起式C"
  },
  {
    "code": "019310",
    "name": "中航恒宇港股通价值优选混合发起C"
  },
  {
    "code": "024865",
    "name": "富国恒生港股通汽车主题ETF发起式联接C"
  },
  {
    "code": "024228",
    "name": "东方红中证港股通高股息投资指数C"
  },
  {
    "code": "019409",
    "name": "易方达中证港股通中国100ETF联接发起式C"
  },
  {
    "code": "019416",
    "name": "南方港股医药行业混合发起(QDII)C"
  }
];



/*
合并AC,C进入到新的c-code的属性里面

滤除掉不能交易的

滤除掉资金在1-150亿之外的

能否把成份-比如阿里等的搂出来

*/
