/*
长期推荐组合：
007467-华泰柏瑞中证红利低波C
020989-南方恒生科技指数发起C
018561-中信保诚多策略灵活C
019260-富国恒生红利ETF联接A
023918-华夏国证自由现金流C

量化：
{ code: '018561', name: '中信保诚多策略C' },
{ code: '020726', name: '建信灵活配置混合C' },
{ code: '016858', name: '国金量化多因子股票C' },
{ code: '018729', name: '华夏智胜新锐股票C' },
{ code: '023350', name: '诺安多策略混合C' },

新增机器人方向推荐：
易方达机器人ETF联接C(020973)

新增美股方向推荐：
华宝纳斯达克精选股票发起式(QDII)C(017437)
南方纳斯达克100指数发起(QDII)A(016452)
宝盈纳斯达克100指数发起(QDII)A人民币(019736)

债券类推荐：
006980-国寿安保泰恒纯债债券
016870-景顺长城稳健增益C

其它5+推荐：
007540-华泰保兴安悦债券A
007584-鹏华丰鑫债券A

http://150.158.175.108:9999/preview.html 最新的基金涨幅预览地址哈

*/
