/*
红利或者股票型：
{ code: '007467', name: '华泰柏瑞中证红利低波C' },
{ code: '019260', name: '富国恒生红利ETF联接A' },
{ code: '020989', name: '南方恒生科技指数发起C' },
{ code: '023918', name: '华夏国证自由现金流C' },
{ code: '023521', name: '博时上证科创板人工智能ETF发起式联接C' },
{ code: '020973', name: '易方达机器人ETF联接C' },

量化：
{ code: '018561', name: '中信保诚多策略C' },// 30天
{ code: '020726', name: '建信灵活配置混合C' },// 30天
{ code: '002834', name: '华夏新锦绣混合C' },// 30天
{ code: '016858', name: '国金量化多因子股票C' },// 30天
{ code: '018729', name: '华夏智胜新锐股票C' },// 30天
{ code: '023350', name: '诺安多策略混合C' },// 30天

核能:
永赢制造升级智选混合发起C(024203)
华富天鑫灵活配置混合C(003153)

深海科技：
永赢启源混合发起C(016561)

美股方向推荐：
华宝纳斯达克精选股票发起式(QDII)C(017437)
南方纳斯达克100指数发起(QDII)A(016452)
宝盈纳斯达克100指数发起(QDII)A人民币(019736)

债券类推荐：
006980-国寿安保泰恒纯债债券
016870-景顺长城稳健增益C

债券类其它5+推荐：
007540-华泰保兴安悦债券A
007584-鹏华丰鑫债券A

http://150.158.175.108:9999/preview.html 最新的基金涨幅预览地址哈

*/

/*
可以看到很多数据
https://fund.eastmoney.com/pingzhongdata/019260.js?v=20250724153651

实时涨幅
https://fundgz.1234567.com.cn/js/019260.js
https://fundgz.1234567.com.cn/js/019260.js?rt=1753342851359

https://image.sinajs.cn/newchart/v5/fundpre/min_s/008164.gif 涨幅

https://basic.10jqka.com.cn/JPZV30/ 可以按这个展示格式扣下数据

买卖规则
https://ms.jr.jd.com/gw/generic/jj/h5/m/getFundTradeRulesPageInfo?reqData={"fundCode":"515450","orderLimit":"","channel":"9"}


*/

/*
从下面读取 投资策略中 有量化
http://fundf10.eastmoney.com/jbgk_018561.html
*/

/*
中央汇金系列：
华泰柏瑞沪深300ETF(510300) 场内交易
华泰柏瑞沪深300ETF联接A(460300)
华泰柏瑞沪深300ETF联接C(006131)
华泰柏瑞沪深300ETF联接I(022699)
华泰柏瑞沪深300ETF联接Y(022948)

华夏上证50ETF(510050) 场内交易
华夏上证50ETF联接A(001051)
华夏上证50ETF联接C(005733)
华夏上证50ETF联接Y(022959)

医药相关：
国泰国证疫苗与生物科技ETF发起联接C(017186)
*/

/*
其它关注：
富国恒生红利ETF联接C(019261)
中欧红利优享混合C(004815)
易方达恒生红利低波ETF联接C(021458)
万家中证港股通央企红利ETF联接C(023573)
摩根标普港股通低波红利指数A(005051)
景顺长城中证港股通科技ETF发起联接C(016496)
广发中证港股通非银ETF发起式联接C(020501)
富国中证AAA科技创新公司债ETF(159200) -- 场内交易
嘉实全球产业升级股票发起式(QDII)A(017730)
嘉实全球产业升级股票发起式(QDII)C(017731)
富国全球消费精选混合(QDII)人民币C(012062)
永赢科技智选混合发起C(022365)
易方达标普信息科技指数(QDII-LOF)A(人民币)(161128)
华夏中证机器人ETF发起式联接C(018345)
*/

/*

https://saithink.top/guide/demo.html 模板网站

  http://j4.dfcfw.com/charts/pic6/008087.png?v=1754900040433
  https://image.sinajs.cn/newchart/v5/fund/nav/ss/008087.gif?v=1754899979474
  008087要进入到监控

  宝盈转型动力混合C(015389)  进入量化候选：2025年08月12日14:57:23

  016531 - 碳中和
  015389 - 进入候选

  银华中证5G通信主题ETF联接A(008889)
  银华中证5G通信主题ETF联接C(010524)

  华夏中证5G通信主题ETF联接A(008086)
  华夏中证5G通信主题ETF联接D(023765)

  东财互联网C(012372) 适合到一定为止，但是是否和红利类的重合？


  qq邮件里面怎么才能渲染出来 后来才请求的内容 比如018561的实际涨幅呢？还是在服务端先整理好

  electron的学习
  uniapp-开发鸿蒙开发
  还有专门的鸿蒙开发
  wasm开发
  vue源码学习
  开发模式的学习
  开始刷算法
  切片上传和多个大文件下载
  负载均衡
  性能监听、优化、错误上传
  canvas、svg绘制图形学习
  threejs、d3等的学习
  绘制流程图那些插件的学习
  wobworker的学习
  react和angular的学习
  ssr、SSG、ISR
  加密

  next
  nuxt
  wss协议
  uniapp
  taro学习一下
  各种数据库的使用  nodejs-进行链接试试
  反编译

  张燕辉的学习笔记还在吗？

  虚拟币交易的学习、开发
  学一点java
  学python
  学rust
*/
