var arr = [
  { "CODE": "017512", "NAME": "广发北证50成份指数A" },
  { "CODE": "017513", "NAME": "广发北证50成份指数C" },
  { "CODE": "017526", "NAME": "华夏北证50成份指数C" },
  { "CODE": "017522", "NAME": "富国北证50成份指数C" },
  { "CODE": "017516", "NAME": "易方达北证50成份指数C" },
  { "CODE": "017525", "NAME": "华夏北证50成份指数A" },
  { "CODE": "017521", "NAME": "富国北证50成份指数A" },
  { "CODE": "017528", "NAME": "嘉实北证50成份指数C" },
  { "CODE": "017515", "NAME": "易方达北证50成份指数A" },
  { "CODE": "018121", "NAME": "万家北证50成份指数发起式C" },
  { "CODE": "017520", "NAME": "汇添富北证50成份指数C" },
  { "CODE": "020828", "NAME": "东财北证50A" },
  { "CODE": "020829", "NAME": "东财北证50C" },
  { "CODE": "017527", "NAME": "嘉实北证50成份指数A" },
  { "CODE": "017518", "NAME": "招商北证50成份指数发起式C" },
  { "CODE": "018113", "NAME": "工银北证50成份指数C" },
  { "CODE": "018129", "NAME": "博时北证50成份指数发起式C" },
  { "CODE": "018128", "NAME": "博时北证50成份指数发起式A" },
  { "CODE": "021299", "NAME": "中欧北证50成份指数发起C" },
  { "CODE": "018112", "NAME": "工银北证50成份指数A" },
  { "CODE": "017524", "NAME": "南方北证50成份指数发起C" },
  { "CODE": "017519", "NAME": "汇添富北证50成份指数A" },
  { "CODE": "019994", "NAME": "创金合信北证50成份指数增强C" },
  { "CODE": "018115", "NAME": "鹏扬北证50成份指数C" },
  { "CODE": "017523", "NAME": "南方北证50成份指数发起A" },
  { "CODE": "021298", "NAME": "中欧北证50成份指数发起A" },
  { "CODE": "018120", "NAME": "万家北证50成份指数发起式A" },
  { "CODE": "017517", "NAME": "招商北证50成份指数发起式A" },
  { "CODE": "019993", "NAME": "创金合信北证50成份指数增强A" },
  { "CODE": "021173", "NAME": "华安北证50成份指数发起式C" },
  { "CODE": "021162", "NAME": "天弘北证50成份指数发起C" },
  { "CODE": "018114", "NAME": "鹏扬北证50成份指数A" },
  { "CODE": "021172", "NAME": "华安北证50成份指数发起式A" },
  { "CODE": "021102", "NAME": "国泰北证50成份指数发起C" },
  { "CODE": "021161", "NAME": "天弘北证50成份指数发起A" },
  { "CODE": "021688", "NAME": "鹏华北证50成份指数发起式C" },
  { "CODE": "021101", "NAME": "国泰北证50成份指数发起A" },
  { "CODE": "021115", "NAME": "南方北证50成份指数发起I" },
  { "CODE": "021766", "NAME": "长盛北证50成份指数增强C" },
  { "CODE": "021765", "NAME": "长盛北证50成份指数增强A" },
  { "CODE": "021687", "NAME": "鹏华北证50成份指数发起式A" },
  { "CODE": "021691", "NAME": "招商资管北证50成份指数发起C" },
  { "CODE": "023442", "NAME": "前海开源北证50成份指数发起C" },
  { "CODE": "023441", "NAME": "前海开源北证50成份指数发起A" },
  { "CODE": "021690", "NAME": "招商资管北证50成份指数发起A" },
  { "CODE": "023396", "NAME": "宝盈北证50成份指数发起式C" },
  { "CODE": "023659", "NAME": "华泰柏瑞北证50成份指数A" },
  { "CODE": "023660", "NAME": "华泰柏瑞北证50成份指数C" },
  { "CODE": "023395", "NAME": "宝盈北证50成份指数发起式A" },
  { "CODE": "023887", "NAME": "永赢北证50成份指数发起C" },
  { "CODE": "023886", "NAME": "永赢北证50成份指数发起A" },
  { "CODE": "023661", "NAME": "华泰柏瑞北证50成份指数I" }
];

/*
需要的数据:
是否开放购买

交易状态：开放申购 开放赎回
购买手续费： 0.00% 费率详情>

近1月：1.60%
近3月：5.10%
近6月：1.95%
近1年：4.91%
近3年：30.50%
类型：指数型-股票  |  中高风险
规模：30.90亿元（2025-03-31）
基金经理：柳军
成 立 日：2019-07-15
管 理 人：华泰柏瑞基金
跟踪标的：中证红利低波动指数 | 年化跟踪误差：1.82%

分红状态

持有人结构
*/



var arr =[{"number":"002084","name":"新华鑫动力灵活配置混合C","remarks":"","notice":"1.7,2.08"},{"number":"005969","name":"创金合信工业周期C","remarks":"","notice":"1.8,2.2"},{"number":"004997","name":"广发高端制造股票A","remarks":"","notice":"1.7,1.82"},{"number":"012301","name":"易方达核心智造混合","remarks":"","notice":"0.7,1"},{"number":"000536","name":"前海开源可转债债券","remarks":"","notice":"1.2,1.4"},{"number":"006482","name":"广发可转债债券A","remarks":"","notice":"1.5,1.64"},{"number":"003547","name":"鹏华丰禄债券","remarks":"","notice":"1.06,1.1"},{"number":"004010","name":"华泰柏瑞鼎利灵活配置混合A","remarks":"","notice":"1.5,1.7"},{"number":"008087","name":"5","remarks":"1","notice":"1,1.05"}];localStorage.setItem("info",JSON.stringify(arr));window.location.reload();
